In [1]:
import pandas as pd
import numpy as np

In [55]:
# series can also be created from a dictionary

serie1 = pd.Series([23, 34, 45, 56])
serie2 = pd.Series([23, 34, 45, 56], index=['sss', 'ff', 'a', 'djf'])

print(serie1)
print('\n')
print(serie2)

0    23
1    34
2    45
3    56
dtype: int64


sss    23
ff     34
a      45
djf    56
dtype: int64

In [3]:
# notice that you pass a dictionary
df = pd.DataFrame({'names': ['pinco', 'panco', 'pallino'], 'age': [11, 22, 33]})

print(df)
display(df)

     names  age
0    pinco   11
1    panco   22
2  pallino   33

     names  age
0    pinco   11
1    panco   22
2  pallino   33

In [57]:
print(df.loc[2])

names    pallino
age           33
Name: 2, dtype: object

In [58]:
# being small the dataset, we get the same results using head and tail

# also info is useful with big dataframe

print(df.head)
print(df.tail)
print(df.info)

<bound method NDFrame.head of      names  age
0    pinco   11
1    panco   22
2  pallino   33>
<bound method NDFrame.tail of      names  age
0    pinco   11
1    panco   22
2  pallino   33>
<bound method DataFrame.info of      names  age
0    pinco   11
1    panco   22
2  pallino   33>

In [4]:
display(df == 11)

display(df[df==22])

display(df[df == 11].any(axis=1))

display(pd.concat((df, df), axis=1))

   names    age
0  False   True
1  False  False
2  False  False

  names   age
0   NaN   NaN
1   NaN  22.0
2   NaN   NaN

0     True
1    False
2    False
dtype: bool

     names  age    names  age
0    pinco   11    pinco   11
1    panco   22    panco   22
2  pallino   33  pallino   33

the function groupby is very useful: read documentation

the function .dropna() drops rows or columns with missing values (read documentation)

it returns a new dataframe; if you want to do it in place use the option inplace=True;
then use .reset_index() to reset the indexes (don't forget to drop the column with
the old indexes afterwards: see below for example)

the function .fillna() fills the NA's in the dataframe with its argument; again NOT in place

we can use .replace() to replace values in the dataframe

In [60]:
# dropping a row

print(df.drop(1, axis='rows'))   # NOT in place

     names  age
0    pinco   11
2  pallino   33

#### basic statistics

we can use the function .mean() to compute the mean (use axis parameter for by column/by row)

with .sort_values you can sort the values

#### saving dataframe

for example we can use .to_csv() to save the the dataframe in a csv format

#### plot

there exists a method .plot !!!

#### apply function

simile ad apply in R; NON è in place

In [84]:
df = df = pd.DataFrame({'names': ['pinco', 'panco', 'pallino'], 'age': [11, 22, 33]})
df2 = pd.DataFrame({'blabla': (111, 222, 333)})
df = pd.concat((df, df2), axis=1)    # note that 0='columns'

display(df.iloc[:, 1:3].apply(np.sqrt))
display(df.iloc[:, 1:3].apply(np.mean, axis='rows'))

        age     blabla
0  3.316625  10.535654
1  4.690416  14.899664
2  5.744563  18.248288

age        22.0
blabla    222.0
dtype: float64